In [5]:
USE TSQLV4;
SET NOCOUNT ON

CREATE TABLE ##tmp1
(
    Rcd_Id INT IDENTITY(1, 1) NOT NULL,
    employee_id INT,
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    dept_id VARCHAR(25),
    manager_id INT,
    salary INT,
    expertise VARCHAR(25),
    PRIMARY KEY (Rcd_Id)
)

INSERT INTO ##tmp1
VALUES
(100, 'John', 'White', 'IT', 103, 120000, 'Senior')
INSERT INTO ##tmp1
VALUES
(101, 'Mary', 'Danner', 'Account', 109, 80000, 'junior')
INSERT INTO ##tmp1
VALUES
(102, 'Ann', 'Lynn', 'Sales', 107, 140000, 'Semisenior')
INSERT INTO ##tmp1
VALUES
(103, 'Peter', 'O''connor', 'IT', 110, 130000, 'Senior')
INSERT INTO ##tmp1
VALUES
(106, 'Sue', 'Sanchez', 'Sales', 107, 110000, 'Junior')
INSERT INTO ##tmp1
VALUES
(107, 'Marta', 'Doe', 'Sales', 110, 180000, 'Senior')
INSERT INTO ##tmp1
VALUES
(109, 'Ann', 'Danner', 'Account', 110, 90000, 'Senior')
INSERT INTO ##tmp1
(
    employee_id,
    first_name,
    last_name,
    dept_id,
    salary,
    expertise
)
VALUES
(110, 'Simon', 'Yang', 'CEO', 250000, 'Senior')
INSERT INTO ##tmp1
VALUES
(111, 'Juan', 'Graue', 'Sales', 102, 37000, 'Junior')

-- Select * from #tmp1

--drop table ##tmp1

- ROW\_NUMBER()/RANK()/DENSE\_RANK()区别

    - ROW\_NUMBER()：排序，不会有重复的排序数值。对于相等的两个数字，排序序号不一致
    - DENSE\_RANK()：排序，可有重复值。对于相等的两个数字，排序序号一致
    - RANK()：排序，可有重复值。对于相等的两个数字，排序序号一致，但是总数会减少

In [18]:
SELECT employee_id,
       last_name,
       first_name,
       salary,
       RANK() OVER (ORDER BY salary DESC) AS ranking
FROM ##tmp1

employee_id,last_name,first_name,salary,ranking
110,Yang,Simon,250000,1
107,Doe,Marta,180000,2
102,Lynn,Ann,140000,3
103,O'connor,Peter,130000,4
100,White,John,120000,5
106,Sanchez,Sue,110000,6
109,Danner,Ann,90000,7
101,Danner,Mary,80000,8
111,Graue,Juan,37000,9

In [20]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           RANK() OVER (ORDER BY salary DESC) AS ranking
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking <= 5
ORDER BY ranking

employee_id,last_name,first_name,salary
110,Yang,Simon,250000
107,Doe,Marta,180000
102,Lynn,Ann,140000
103,O'connor,Peter,130000
100,White,John,120000

In [21]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           RANK() OVER (ORDER BY salary ASC) AS ranking
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking <= 5
ORDER BY ranking

employee_id,last_name,first_name,salary
111,Graue,Juan,37000
101,Danner,Mary,80000
109,Danner,Ann,90000
106,Sanchez,Sue,110000
100,White,John,120000

In [2]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           RANK() OVER (ORDER BY salary ASC) AS ranking
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking = 2
ORDER BY ranking

employee_id,last_name,first_name,salary
101,Danner,Mary,80000

In [7]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           dept_id,
           RANK() OVER (PARTITION BY dept_id ORDER BY salary DESC) AS ranking
    FROM ##tmp1)
SELECT dept_id,
       employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking = 2
ORDER BY dept_id,
         ranking

dept_id,employee_id,last_name,first_name,salary
Account,101,Danner,Mary,80000
IT,100,White,John,120000
Sales,102,Lynn,Ann,140000

- there is a SQL function called NTILE() which receives an integer parameter indicating the number of subsets into which we want to divide the entire result set.

In [8]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           NTILE(2) OVER (ORDER BY salary) AS ntile
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ntile = 1
ORDER BY salary

employee_id,last_name,first_name,salary
111,Graue,Juan,37000
101,Danner,Mary,80000
109,Danner,Ann,90000
106,Sanchez,Sue,110000
100,White,John,120000

In [9]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           NTILE(4) OVER (ORDER BY salary) AS ntile
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ntile = 4
ORDER BY salary

employee_id,last_name,first_name,salary
107,Doe,Marta,180000
110,Yang,Simon,250000

In [11]:
SELECT employee_id,
       last_name,
       first_name,
       salary,
       ROW_NUMBER() OVER (ORDER BY employee_id) AS ranking_position
FROM ##tmp1

employee_id,last_name,first_name,salary,ranking_position
100,White,John,120000,1
101,Danner,Mary,80000,2
102,Lynn,Ann,140000,3
103,O'connor,Peter,130000,4
106,Sanchez,Sue,110000,5
107,Doe,Marta,180000,6
109,Danner,Ann,90000,7
110,Yang,Simon,250000,8
111,Graue,Juan,37000,9

In [5]:
SELECT e1.first_name + ' ' + e1.last_name AS manager_name,
       e2.first_name + ' ' + e2.last_name AS employee_name
FROM ##tmp1 e1
    JOIN ##tmp1 e2
        ON e1.employee_id = e2.manager_id

manager_name,employee_name
Ann Lynn,Juan Graue
Peter O'connor,John White
Marta Doe,Ann Lynn
Marta Doe,Sue Sanchez
Ann Danner,Mary Danner
Simon Yang,Peter O'connor
Simon Yang,Marta Doe
Simon Yang,Ann Danner

In [7]:
SELECT first_name,
       last_name,
       salary
FROM ##tmp1
WHERE salary >
(
    SELECT AVG(salary)FROM ##tmp1
)

first_name,last_name,salary
Ann,Lynn,140000
Peter,O'connor,130000
Marta,Doe,180000
Simon,Yang,250000

In [6]:
SELECT first_name,
       last_name,
       salary
FROM ##tmp1 e1
WHERE salary >
(
    SELECT AVG(salary) FROM ##tmp1 e2 WHERE e1.dept_id = e2.dept_id
)

first_name,last_name,salary
Ann,Danner,90000
Peter,O'connor,130000
Marta,Doe,180000
Ann,Lynn,140000

In [8]:
SELECT employee_id,
       last_name,
       first_name,
       dept_id,
       manager_id,
       salary
FROM ##tmp1
GROUP BY employee_id,
         last_name,
         first_name,
         dept_id,
         manager_id,
         salary
HAVING COUNT(*) > 1

In [17]:
USE TSQLV4;
SET NOCOUNT ON

CREATE TABLE ##tmp2
(
    Rcd_Id INT IDENTITY(1, 1) NOT NULL,
    id INT,
    day DATETIME,
    Registered_Users INT
        PRIMARY KEY (Rcd_Id)
)

INSERT INTO ##tmp2
VALUES
(1, '2023-1-25', 51)
INSERT INTO ##tmp2
VALUES
(2, '2023-1-26', 46)
INSERT INTO ##tmp2
VALUES
(3, '2023-1-27', 41)
INSERT INTO ##tmp2
VALUES
(4, '2023-1-30', 59)
INSERT INTO ##tmp2
VALUES
(5, '2023-1-31', 73)
INSERT INTO ##tmp2
VALUES
(6, '2023-2-1', 34)
INSERT INTO ##tmp2
VALUES
(7, '2023-2-2', 56)
INSERT INTO ##tmp2
VALUES
(8, '2023-2-4', 34)

SELECT *
FROM ##tmp2

: Msg 2714, Level 16, State 6, Line 4
There is already an object named '##tmp2' in the database.

In [28]:
WITH data_series
AS (SELECT RANK() OVER (ORDER BY day) AS row_number,
           day,
           day - RANK() OVER (ORDER BY day) AS series_id
    FROM ##tmp2)
SELECT MIN(day) AS series_start_date,
       MAX(day) AS series_end_date,
       cast((MAX(day) - MIN(day) + 1) AS INT) AS series_length
FROM data_series
GROUP BY series_id
ORDER BY series_start_date

-- Select * from data_series

series_start_date,series_end_date,series_length
2023-01-25 00:00:00.000,2023-01-27 00:00:00.000,3
2023-01-30 00:00:00.000,2023-02-02 00:00:00.000,4
2023-02-04 00:00:00.000,2023-02-04 00:00:00.000,1